<a href="https://colab.research.google.com/github/ciniraharsaning/ciniraharsaning/blob/main/Cinira%20Harsaning%20Aziz.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Latihan Pandas 1**

## Jangan di-run! Buat file baru untuk menjawab

**Membuat DataFrame**

Ikuti semua petunjuk yang harus dilakukan di bawah ini.

**Step 1. Import library yang dibutuhkan.**

**Step 2. Buat dictionary untuk membuat DataFrame berjumlah 5 key dan masing-masing key memiliki value berupa list dengan 10 item. Isi dari dictionary  mengikuti output Step 3.**

**Step 3. Ubah dictionary dari Step.2 menjadi bentuk DataFrame dan simpan ke dalam variabel baru bernama df.**

    Nama  Umur  Gender       Pekerjaan           Domisili
0   Andi    24    Pria    Data Analyst            Jakarta
1   Budi    25    Pria   Data Engineer  Tangerang Selatan
2   Caca    30  Wanita  Data Scientist            Jakarta
3   Dedi    32    Pria  Data Scientist            Bandung
4  Erika    28  Wanita    Data Analyst            Jakarta
5  Fahri    24    Pria   Data Engineer           Surabaya
6   Gina    29  Wanita     ML Engineer            Bandung
7   Hani    31  Wanita   ML Researcher         Yogyakarta
8   Irja    30    Pria      BI Analyst            Jakarta
9  Jarot    29    Pria    Data Analyst  Tangerang Selatan

**Step 4. Ubah urutan kolom tersebut menjadi seperti berikut: Nama, Gender, Umur, Domisili, Pekerjaan.**

    Nama  Gender  Umur           Domisili       Pekerjaan
0   Andi    Pria    24            Jakarta    Data Analyst
1   Budi    Pria    25  Tangerang Selatan   Data Engineer
2   Caca  Wanita    30            Jakarta  Data Scientist
3   Dedi    Pria    32            Bandung  Data Scientist
4  Erika  Wanita    28            Jakarta    Data Analyst
5  Fahri    Pria    24           Surabaya   Data Engineer
6   Gina  Wanita    29            Bandung     ML Engineer
7   Hani  Wanita    31         Yogyakarta   ML Researcher
8   Irja    Pria    30            Jakarta      BI Analyst
9  Jarot    Pria    29  Tangerang Selatan    Data Analyst

**Step 5. Tambahkan 1 kolom baru bernama 'Hobi' dan isikan datanya seperti output berikut.**

    Nama  Gender  Umur           Domisili       Pekerjaan       Hobi
0   Andi    Pria    24            Jakarta    Data Analyst     Gaming
1   Budi    Pria    25  Tangerang Selatan   Data Engineer     Futsal
2   Caca  Wanita    30            Jakarta  Data Scientist       Baca
3   Dedi    Pria    32            Bandung  Data Scientist     Gaming
4  Erika  Wanita    28            Jakarta    Data Analyst      Masak
5  Fahri    Pria    24           Surabaya   Data Engineer  Traveling
6   Gina  Wanita    29            Bandung     ML Engineer     Basket
7   Hani  Wanita    31         Yogyakarta   ML Researcher  Traveling
8   Irja    Pria    30            Jakarta      BI Analyst     Gaming
9  Jarot    Pria    29  Tangerang Selatan    Data Analyst     Futsal

**Soal Lanjutan**

**6. Gunakan .iloc untuk mengambil data Dedi, Fahri, Hani**

    Nama  Gender  Umur    Domisili       Pekerjaan       Hobi
3   Dedi    Pria    32     Bandung  Data Scientist     Gaming
5  Fahri    Pria    24    Surabaya   Data Engineer  Traveling
7   Hani  Wanita    31  Yogyakarta   ML Researcher  Traveling

**7. Gunakan .loc untuk menampilkan domisili dan pekerjaan dari Caca dan Irja (termasuk kolom nama)**

   Nama Domisili       Pekerjaan
2  Caca  Jakarta  Data Scientist
8  Irja  Jakarta      BI Analyst

**8. Gunakan .loc untuk menampilkan semua data dari Hani, Irja, Jarot**

    Nama  Gender  Umur           Domisili      Pekerjaan       Hobi
7   Hani  Wanita    31         Yogyakarta  ML Researcher  Traveling
8   Irja    Pria    30            Jakarta     BI Analyst     Gaming
9  Jarot    Pria    29  Tangerang Selatan   Data Analyst     Futsal

**9. Siapa sajakah yang berumur lebih dari 30 tahun?**

   Nama  Gender  Umur    Domisili       Pekerjaan       Hobi
3  Dedi    Pria    32     Bandung  Data Scientist     Gaming
7  Hani  Wanita    31  Yogyakarta   ML Researcher  Traveling

**10. Siapa sajakah yang berumur kurang dari 30 tahun dan hobinya Gaming?**

   Nama Gender  Umur Domisili     Pekerjaan    Hobi
0  Andi   Pria    24  Jakarta  Data Analyst  Gaming

**11. Tampilkan nama orang yang pekerjaannya adalah Data Analyst! Tampilkan kolom nama saja dalam bentuk Series!**

0     Andi
4    Erika
9    Jarot
Name: Nama, dtype: object

**12. Apa saja pekerjaan orang-orang yang berdomisili di Jakarta? Tampilkan nama dan pekerjaannya!**

    Nama       Pekerjaan
0   Andi    Data Analyst
2   Caca  Data Scientist
4  Erika    Data Analyst
8   Irja      BI Analyst

**13. Apa saja hobi para wanita yang ada di data? Tampilkan hanya kolom Nama, Hobi, Umur secara berurutan!**

    Nama       Hobi  Umur
2   Caca       Baca    30
4  Erika      Masak    28
6   Gina     Basket    29
7   Hani  Traveling    31

**14. Siapa saja yang berumur lebih tua dari Erika? Tampilkan kolom nama saja dalam bentuk DataFrame!**

    Nama
2   Caca
3   Dedi
6   Gina
7   Hani
8   Irja
9  Jarot

**15. Berdasarkan data, apakah ada wanita yang hobinya traveling?**

   Nama  Gender  Umur    Domisili      Pekerjaan       Hobi
7  Hani  Wanita    31  Yogyakarta  ML Researcher  Traveling